import comyuterImg from "../assets/compyuter.jpeg";
import iphone14ProImg from "../assets/iphone14ProImg.jpeg";
import xiomiPhoneImg from "../assets/xiomiPhoneImg.jpg";
import samsungPhoneImg from "../assets/samsungPhoneImg.jpg";
import lenovoLaptopImg from "../assets/lenovoLaptopImg.jpeg";
import diskM2Img from "../assets/diskM2Img.jpeg";
import sonyPlayStationImg from "../assets/sonyPlayStationImg.jpeg";
export const DATA = [
  {
    id: "pro-1",
    discount: "-15%",
    url: comyuterImg,
    title: 'Ноутбук Lenovo V15-IGL N4020 4/256 GB SSD 15.6" HD (from UAE)',
    firsPrice: 2_987_000,
    price: 2_538_950,
    characteristics: [
      { name: "Количество ядер процессора", value: "2 ядра" },
      { name: "Экран", value: '15.6" HD 1366x768' },
      { name: "Веб-камера", value: "Есть" },
      { name: "Тип матрицы экрана", value: "TN" },
      { name: "Частота обновления экрана", value: "60 Hz" },
      { name: "Процессор", value: "Intel Celeron N4020" },
      { name: "Общий объем накопителей", value: "256GB SSD" },
      { name: "Тип памяти", value: "DDR4" },
      { name: "Оперативная память", value: "4 ГБ" },
    ],
    desc: `Современный дизайн этого ноутбука придает ему превосходный внешний вид. А его тонкий корпус отлично подходит для путешествий. Опциональный 15,6-дюймовый дисплей обеспечивает яркость цветов и четкость изображения, а узкие боковые рамки улучшают обзор. Для ноутбука были проведены специальные тесты на надежность и прочность в экстремальных условиях: испытания на устойчивость к ударам, виброустойчивость, работоспособность клавиатуры, выносливость петель,  защиту панелей от царапин, защиту от перепадов температур и повышенного давления.`,
  },
  {
    id: "pro-2",
    discount: "-7%",
    url: iphone14ProImg,
    title: "Apple iPhone 14 Pro",
    firsPrice: 15_000_000,
    price: 14_000_000,
    characteristics: [
      { name: "Цвет", value: "Silver" },
      { name: "Версия ОС", value: "iOS 16" },
      { name: "Размеры", value: "147.5 x 71.5 x 7.85 мм" },
      { name: "Влагозащита", value: "Есть, IP68" },
      { name: "Цвет", value: "Gold" },
      { name: "Цвет", value: "Space Black" },
      { name: "Цвет", value: "Deep Purple" },
      { name: "Тип памяти", value: "DDR4" },
      { name: "Датчик Face ID", value: "Есть" },
    ],
    desc: `
    Теперь ваш экран блокировки всегда виден, так что вам даже не нужно нажимать на него, чтобы быть в курсе.
    
    Когда iPhone перевернут лицевой стороной вниз или находится в кармане, он отключается для экономии заряда аккумулятора.
    Целый день автономной работы даже с таким количеством новых возможностей
    
    Твое фото. Ваш шрифт. Ваши виджеты. Ваш iPhone.
    iOS 16 позволяет по-новому настроить экран блокировки. Наслаивайте фотографию, чтобы она выделялась. Отслеживайте свои кольца активности. И просматривайте живые обновления из ваших любимых приложений.
    
    iPhone 14 Pro может обнаружить серьезную автомобильную аварию, а затем позвонить в службу экстренной помощи и уведомить ваши контакты для экстренных случаев.
    
    Внезапное изменение скорости
    Новый акселерометр с высокой перегрузкой определяет экстремальное ускорение или замедление до 256 g.
    
    Изменения давления в кабине
    Барометр может обнаруживать изменения давления, вызванные срабатыванием подушек безопасности.
    
    Резкая смена направления
    Гироскоп с широким динамическим диапазоном отслеживает резкие изменения ориентации автомобиля.
    
    Уровни громкого звука удара
    Во время вождения микрофон определяет экстремальные уровни звука при столкновении. В целях конфиденциальности вся обработка выполняется на вашем iPhone.
    
    Лабораторные краш-тесты
    Мы разработали передовые алгоритмы движения, выполнив краш-тесты при лобовом столкновении, ударе сзади, боковом ударе и опрокидывании.
    
    Данные о реальных авариях
    Мы использовали общедоступные данные об авариях, чтобы сделать обнаружение сбоев максимально точным.
    
    1 миллион часов реальных данных о вождении и авариях помогают iPhone распознавать аварии
    
    Система камер Pro становится намного больше Pro
    Представляем совершенно новую основную камеру на 48 МП с усовершенствованным четырехпиксельным сенсором.
    
    iPhone 14 Pro поднимает планку того, на что способны 48 мегапикселей, обеспечивая 4-кратное увеличение разрешения в формате ProRAW для невероятной детализации при каждом кадрировании.
    Датчик на 65% больше, чем у iPhone 13 Pro
    
    Четырехпиксельный датчик на основной камере максимально использует 48 мегапикселей, адаптируясь к тому, что вы снимаете.
    
    Для большинства фотографий вы хотите оптимизировать захват света. Таким образом, новый датчик объединяет четыре пикселя в один большой четырехъядерный пиксель, собирая в 4 раза больше света и создавая значительно более качественные фотографии при практическом размере 12 МП.
    
    В других случаях лучше оптимизировать детали. В таких случаях датчик использует каждый отдельный пиксель, предоставляя больше творческих возможностей для съемки и редактирования в профессиональных рабочих процессах.
    
    Для идеального сочетания детализации и гибкости снимайте в формате ProRAW с разрешением 48 МП. Новая модель машинного обучения обеспечивает более четкое изображение и меньше шума для беспрецедентной детализации. Таким образом, вы можете переформатировать свои фотографии, сохраняя при этом потрясающее разрешение.
    
    Добро пожаловать в полный творческий контроль.
    
    Четырехпиксельный датчик позволяет нам выйти за рамки трех фиксированных объективов системы камер Pro, чтобы создать дополнительный 2-кратный телеобъектив. Что расширяет ваши параметры масштабирования до 0,5x, 1x, 2x и 3x.
    
    Этот новый телефото использует средние 12 мегапикселей четырехпиксельного датчика для создания фотографий с полным разрешением и видео 4K без цифрового увеличения.
    
    И он работает в режимах «Портрет», «Интервал» и «Панорама», а это означает, что великолепные фотографии крупным планом и видеоролики находятся на расстоянии одного касания.
    
    Чтобы расширить границы фотосъемки при слабом освещении, мы начали с более крупных сенсоров, которые захватывают значительно больше света.
    
    Затем мы добавили совершенно новый Photonic Engine, революционный конвейер обработки изображений. Это позволяет Deep Fusion, который объединяет лучшие пиксели из нескольких экспозиций в одну феноменальную фотографию, происходить раньше в процессе обработки несжатых изображений.
    
    Это позволяет сохранить гораздо больше данных, чтобы обеспечить более яркие, реалистичные цвета и красивые детализированные текстуры при меньшем освещении, чем когда-либо.
    
    Новая вспышка Adaptive True Tone регулирует схему и интенсивность девяти светодиодов в зависимости от фокусного расстояния фотографии, поэтому ваш объект всегда предстает в лучшем свете.
    
    Захватывающий. Рамки. пер. Второй.
    Кинематографический режим теперь снимает в формате 4K HDR со скоростью 24 кадра в секунду — стандарт киноиндустрии.`,
  },
  {
    id: "pro-3",
    discount: "-19%",
    url: xiomiPhoneImg,
    title: "Redmi Note 12 Pro 4G (Global) Графитово-серый 8/256 GB",
    firsPrice: 3_790_000,
    price: 3_100_000,
    characteristics: [
      { name: "Особенности", value: "акселерометр, гироскоп, компас" },
      { name: "Версия ОС", value: "Android 13, MIUI 14" },
      { name: "Цвет", value: "Графитово-серый" },
      { name: "Отпечаток пальца", value: "Есть (сбоку)" },
      {
        name: "Количество и тип SIM-карты",
        value: "Dual SIM (Nano-SIM, dual stand-by)",
      },
    ],
  },
  {
    id: "pro-4",
    discount: "-3%",
    url: samsungPhoneImg,
    title: "Samsung Galaxy A54 5G (Global)",
    firsPrice: 4_338_000,
    price: 4_214_000,
    characteristics: [
      { name: "Цвет", value: "Черный" },
      { name: "Версия ОС", value: "Android 13, One UI 5.1" },
      { name: "Цвет", value: "Фиолетовый" },
      { name: "Цвет", value: "Лайм" },
      { name: "Цвет", value: "Белый" },
      { name: "Отпечаток пальца", value: "под дисплеем, оптический" },
      { name: "Влагозащита", value: "Есть, IP67" },
      {
        name: "Количество и тип SIM-карты",
        value:
          "Single SIM (Nano-SIM, eSIM) or Hybrid Dual SIM (Nano-SIM, dual stand-by)",
      },
      { name: "Особенности", value: "акселерометр, гироскоп, компас" },
    ],
    desc: `Красота в простых вещах
    Дизайн Galaxy A54 5G воплощает стремление к совершенству: задняя панель из премиум-стекла, новое гармоничное расположение камер и лаконичные цветовые решения.
    
    Снимайте потрясающие видео с легкостью
    Благодаря VDIS и широкому углу обзора OIS Galaxy A54 5G снимает высококачественные видео с использованием функции автоматического обнаружения объектов и автофокуса.
    
    Яркий и четкий экран даже при солнечном свете
    Безграничный сверхчеткий 6,4-дюймовый FHD+ экран c частотой обновления 120 Гц обеспечит сверхплавный просмотр любого контента при любом освещении.
    
    До двух дней без подзарядки
    С ёмким аккумулятором 5000 мАч (типичное значение) у вас хватит времени на то, что по-настоящему важно. Искусственный интеллект оптимизирует энергопотребление для увеличения продолжительности работы, а супербыстрая зарядка поможет быстро зарядить устройство.`,
  },
  {
    id: "pro-5",
    discount: "-24%",
    url: lenovoLaptopImg,
    title: 'Ноутбук Lenovo 81WQ001XRK V15 N4020 4GB 1TB 15.6"',
    firsPrice: 4_025_000,
    price: 3_099_000,
    characteristics: [
      { name: "ОЗУ", value: "4 GB DDR4" },
      { name: "Жесткий диск", value: "1TB HDD" },
      { name: "Веб-камера", value: "Есть" },
      { name: "Экран", value: '15.6" HD' },
      { name: "Кэш-память", value: "4 MB" },
      { name: "Установленная ОС", value: "DOS" },
      { name: "Процессор", value: "Intel Celeron N4020" },
      { name: "Видеокарта", value: "Intel UHD Graphics 600" },
      { name: "Количество ядер процессора", value: "2" },
      { name: "Гарантия", value: "1 год" },
    ],
  },
  {
    id: "pro-6",
    discount: "-50%",
    url: diskM2Img,
    title: "SSD Silicon Power A80 M.2 NVME 1TB",
    firsPrice: 2_090_000,
    price: 1_045_000,
    characteristics: [
      { name: "Объем", value: "1TB" },
      { name: "Форм-фактор", value: "M.2" },
      { name: "IOPS записи", value: "500 тыс" },
      { name: "Интерфейс", value: "PCIe NVMe 3.0 x4" },
      { name: "Поддержка NVMe", value: "Есть" },
      { name: "Скорость чтения", value: "до 3400 Мб/с" },
      { name: "Скорость записи", value: "до 3000 МБ/с" },
      { name: "Тип", value: "DDR4" },
      { name: "Датчик", value: "Есть" },
    ],
    desc: `Поддержка NVMe 1.3
    Поддерживает SLC Cache и DRAM Cache Buffer. Обеспечивает высокую производительность SSD при последовательном чтении / записи до 3400 МБ / 3000 МБ и произвольном чтении / записи до 390 000 и 450 000 IOPS.
    P34A80 поддерживает общий улучшенный уровень производительности системы в самых требовательных приложениях не только для графических дизайнеров и фотографов, но и для продвинутых геймеров.
    Поддерживает SLC Cache и DRAM Cache Buffer. Обеспечивает высокую производительность последовательного чтения / записи SSD и произвольного чтения / записи.
    
    Высокая производительность, малый форм-фактор
    P34A80 весит всего 8 граммов. Сочетая в равной степени универсальность и эффективность, небольшой форм-фактор твердотельного накопителя позволяет устанавливать его с одинаковой легкостью в самые тонкие ноутбуки, переносные устройства и настольные ПК.`,
  },
  {
    id: "pro-7",
    discount: "-10%",
    url: iphone14ProImg,
    title: "Xiaomi Redmi Note 12S 8/256GB",
    firsPrice: 2_851_000,
    price: 2_582_000,
    characteristics: [
      { name: "Версия ОС", value: "Android 13" },
      { name: "Материал корпуса", value: "пластик" },
      { name: "Количество и тип SIM-карты", value: "2" },
      { name: "Количество и тип SIM-карты", value: "nano SIM" },
      { name: "Цвет", value: "Green" },
      { name: "Цвет", value: "Black" },
      { name: "Цвет", value: "Blue" },
    ],
    desc: `Три камеры для потрясающих снимков
    Тройная камера с основным модулем 108 Мп получает превосходные фотографии в любых условиях съемки. Ультраширокоугольная камера 8 Мп создает отличные панорамные и групповые
    снимки, а макрокамера 2 Мп поможет сфокусироваться на деталях. И не забываем о селфи, на которых вы всегда выглядите восхитительно благодаря фронтальной камере 16 Мп.
    Непревзойденная мощность MediaTek
    Процессор MediaTek Helio G96 с передовой архитектурой ЦП и мощным графическим процессором Mali-G57 MC2 обеспечивает отличную производительность, высокую скорость обработки
    графики и уникальное быстродействие системы. Xiaomi Redmi Note 12S поможет вам быть лучшим во всем.
    Памяти хватит на все
    Сочетание до 8 Гб ОЗУ LPDDR4X и до 256 Гб ПЗУ UFS 2.2 повышает производительность Xiaomi Redmi Note 12S и увеличивает скорость чтения и записи. Вам не нужно больше ждать ни секунды,
    все игры и приложения на вашем смартфоне загружаются мгновенно. А еще вы можете расширить объем хранилища до 1 Гб и навсегда забыть о нехватке места для сторис и фото.
    Выходите за рамки повседневности
    FHD+ 6.43-дюймовый AMOLED дисплей с поддержкой расширенного цветового охвата DCI-P3 стирает грани между картинкой на экране и реальностью, ведь изображение на нем выглядит
    невероятно живым, ярким и контрастным при любом освещении. Покрытие Corning Gorilla Glass 3 надежно защищает экран от внешних воздействий.
    Целый день активности
    Мощная батарея емкостью 5000 мАч обеспечивает много часов непрерывной работы. Смартфон позволит вам общаться и смотреть видео, играть, читать и фотографировать, и при этом вам не
    грозит нехватка заряда в середине дня. Быстрая зарядка мощностью 33 Вт поможет подзарядиться прямо перед выходом из дома.
    Заметный дизайн
    Благодаря обновленному плоскому дизайну и уникальной шлифованной текстуре задней панели, ваш Xiaomi Redmi Note 12S всегда выглядит безупречно. Три роскошных цвета Ice Blue/ Pearl
    Green/ Onyx Black помогут вам подчеркнуть свой современный стиль.`,
  },
  {
    id: "pro-8",
    discount: "-22%",
    url: sonyPlayStationImg,
    title: "Sony PlayStation 5+DVD (from U.A.E)",
    firsPrice: 7_645_000,
    price: 5_999_000,
    characteristics: [
      { name: "Поддержка 4K UHD", value: "Есть" },
      { name: "Поддержка 3D", value: "Есть" },
      { name: "Жесткий диск", value: "Есть, 825 GB" },
      { name: "Поддержка HD (High Definition)", value: "Есть" },
      { name: "Тип процессора", value: "8-ядерный AMD" },
      { name: "Частота процессора", value: "3.50 ГГц" },
      { name: "Графический процессор", value: "AMD Custom RDNA2" },
      { name: "Оперативная память", value: "16384 Мб, GDDR6" },
      { name: "Видеопамять", value: "2230 МГц" },
      { name: "Коммуникации", value: "Bluetooth, Wi-Fi (802.11ax), Ethernet" },
      {
        name: "Мультимедийные возможности",
        value:
          "Проигрывание видео есть / Blu-ray/ Поддерживаемые форматы MP3, JPEG",
      },
      { name: "Контроллер в комплекте", value: "есть, беспроводной" },
      { name: "Дисковод DVD", value: "Есть" },
    ],
  },
];
